Revit 2027 API
TextRange(TextRange) Constructor
 Constructs a copy of the input TextRange object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TextRange(
	TextRange other
)
Public Sub New (
	other As TextRange
)
public:
TextRange(
	TextRange^ other
)
new :
        other : TextRange -> TextRange
Parameters
other TextRange
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TextRange Class
TextRange Overload
Autodesk.Revit.DB Namespace